/*
  input :
['北海道', '青森県', '岩手県', '宮城県', '秋田県', '山形県', '福島県',
'栃木県', '群馬県', '埼玉県', '千葉県', '東京都', '神奈川県', '新潟県',
'富山県', '石川県', '福井県', '山梨県', '長野県', '岐阜県', '静岡県',
'愛知県', '三重県', '滋賀県', '京都府', '大阪府', '兵庫県', '奈良県',
'和歌山県', '島根県', '岡山県', '広島県', '山口県', '徳島県', '香川県',
'愛媛県', '高知県', '福岡県', '佐賀県', '長崎県', '熊本県', '大分県',
'宮崎県', '鹿児島県', '沖縄県']

  output :
[0 => '北海道', 1 => '青森県', 2 => '岩手県', 3 => '宮城県', 4 => '秋田県', 5 => '山形県', 6 => '福島県', 7 =>
'栃木県', 8 => '群馬県', 9 => '埼玉県', 10 => '千葉県', 11 => '東京都', 12 => '神奈川県', 13 => '新潟県', 14 =>
'富山県', 15 => '石川県', 16 => '福井県', 17 => '山梨県', 18 => '長野県', 19 => '岐阜県', 20 => '静岡県', 21 =>
'愛知県', 22 => '三重県', 23 => '滋賀県', 24 => '京都府', 25 => '大阪府', 26 => '兵庫県', 27 => '奈良県', 28 =>
'和歌山県', 29 => '島根県', 30 => '岡山県', 31 => '広島県', 32 => '山口県', 33 => '徳島県', 34 => '香川県', 35 =>
'愛媛県', 36 => '高知県', 37 => '福岡県', 38 => '佐賀県', 39 => '長崎県', 40 => '熊本県', 41 => '大分県', 42 =>
'宮崎県', 43 => '鹿児島県', 44 => '沖縄県']
*/

/*
S0 초기상태
A1 [을 만남. ('0 => '를 추가함.)
A2 ,를 만남.('숫자 => '를 추가함.)
*/
function setPHPKeyValue(){
  var status = 'S0';
  var result = '[';
  
  var leftPattern = /\[/;
  var rightPattern = /\]/;
  var commaPattern = /,/;
  var arrIndex = 0;
  
  var str = document.getElementById('textId').value;
  for(var i = 0; i < str.length; i++){
    if (status === 'S0' && str[i].match(leftPattern)) {
      result += arrIndex+' => ';
      arrIndex++;
      status = 'A1';
    } else if (status === 'A1' && str[i].match(commaPattern)) {
      result += str[i];
      result += ' '+arrIndex+' =>';
      arrIndex++;
      status = 'A1';
    } else if (status === 'A1' && str[i].match(rightPattern)) {
      result += str[i];
      break;
    } else {
      result += str[i];
    }
  }  
  
  return result;
}